In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../data/learn_pandas.csv')
df.head(1)

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34

In [3]:
df.Gender.unique()

array(['Female', 'Male'], dtype=object)

In [4]:
df.groupby('Gender')['Height']

In [5]:
# 按照性别统计身高中位数
df.groupby('Gender')['Height'].median()

Gender
Female    159.6
Male      173.4
Name: Height, dtype: float64

In [6]:
# 根据学校和性别进行分组， 统计身高的均值
df.groupby(["School", "Gender"])["Height"].mean()

School                         Gender
Fudan University               Female    158.776923
                               Male      174.212500
Peking University              Female    158.666667
                               Male      172.030000
Shanghai Jiao Tong University  Female    159.122500
                               Male      176.760000
Tsinghua University            Female    159.753333
                               Male      171.638889
Name: Height, dtype: float64

In [7]:
# 根据学生体重是否超过总体均值来分组， 计算身高的均值
cdt = df.Weight > df.Weight.mean()
df.groupby(cdt)["Height"].mean()

Weight
False    159.034646
True     172.705357
Name: Height, dtype: float64

`choice`函数

In [8]:
np.random.choice(list("abcd"), 5)

array(['d', 'c', 'c', 'c', 'c'], dtype='<U1')

In [9]:
item = np.random.choice(list('abc'), df.shape[0])
item

array(['a', 'c', 'b', 'a', 'a', 'b', 'c', 'b', 'a', 'c', 'c', 'a', 'a',
       'b', 'b', 'c', 'a', 'b', 'c', 'c', 'c', 'b', 'b', 'c', 'b', 'c',
       'b', 'c', 'b', 'c', 'c', 'a', 'c', 'c', 'c', 'a', 'c', 'a', 'b',
       'a', 'c', 'c', 'a', 'b', 'b', 'b', 'c', 'c', 'c', 'b', 'c', 'b',
       'a', 'c', 'c', 'b', 'c', 'a', 'c', 'a', 'b', 'a', 'a', 'c', 'b',
       'a', 'b', 'a', 'b', 'c', 'a', 'b', 'c', 'b', 'c', 'c', 'c', 'c',
       'b', 'b', 'a', 'b', 'c', 'a', 'b', 'a', 'c', 'b', 'a', 'b', 'b',
       'c', 'b', 'a', 'b', 'b', 'a', 'a', 'a', 'a', 'c', 'c', 'a', 'c',
       'c', 'c', 'b', 'c', 'c', 'b', 'c', 'a', 'b', 'a', 'b', 'c', 'b',
       'c', 'c', 'a', 'b', 'c', 'a', 'c', 'b', 'b', 'c', 'b', 'a', 'c',
       'b', 'a', 'b', 'b', 'c', 'a', 'b', 'c', 'b', 'b', 'a', 'b', 'a',
       'a', 'b', 'b', 'b', 'c', 'c', 'b', 'a', 'c', 'a', 'b', 'a', 'a',
       'c', 'c', 'b', 'c', 'c', 'a', 'c', 'c', 'b', 'c', 'b', 'c', 'c',
       'b', 'a', 'c', 'c', 'a', 'c', 'c', 'a', 'c', 'a', 'c', 'b', 'c',
       'c', 'c', 'b', 'b', 'c', 'b', 'a', 'b', 'a', 'b', 'c', 'a', 'b',
       'c', 'c', 'c', 'c', 'b'], dtype='<U1')

In [10]:
df.groupby(item)["Height"].mean()

a    162.768182
b    163.369355
c    163.353247
Name: Height, dtype: float64

验证：`groupby`按照条件列表中元素的值来分组

In [11]:
data = pd.DataFrame(data = {"col1" : [1, 2, 3, 4], "col2" : [1, 2, 3, 4]})
it = np.random.choice(list("abc"), data.shape[0])
result = data.groupby(it)["col1"].sum()
print(data, it, result, sep = "\n\n")

   col1  col2
0     1     1
1     2     2
2     3     3
3     4     4

['a' 'b' 'c' 'b']

a    1
b    6
c    3
Name: col1, dtype: int64

传入两个条件， 则会按照`组合分组`的`unique`值， False-a; False-b; False-c; True-a; True-b; True-c

In [14]:
df.groupby([cdt, item])['Height'].mean()

Weight
False   a    159.272727
        b    159.023256
        c    158.890196
True    a    173.254545
        b    173.205263
        c    172.107692
Name: Height, dtype: float64

通过 `drop_duplicates` 就能知道具体的组类别, `unique`, 注意不是在`grouby函数`基础上

In [20]:
df[['School', 'Gender']].drop_duplicates()

                           School  Gender
0   Shanghai Jiao Tong University  Female
1               Peking University    Male
2   Shanghai Jiao Tong University    Male
3                Fudan University  Female
4                Fudan University    Male
5             Tsinghua University  Female
9               Peking University  Female
16            Tsinghua University    Male

In [26]:
# 注意不是传入list列表 df.groupby([['School', 'Gender']])
df.groupby(['School', 'Gender'])['Height'].mean()
# df.groupby([df['School'], df['Gender']])['Height'].mean()

School                         Gender
Fudan University               Female    158.776923
                               Male      174.212500
Peking University              Female    158.666667
                               Male      172.030000
Shanghai Jiao Tong University  Female    159.122500
                               Male      176.760000
Tsinghua University            Female    159.753333
                               Male      171.638889
Name: Height, dtype: float64

`groupy对象`
```
ngroups : 访问分为了多少组
groups.keys() : 返回分组后的组合字典
size : 计每个组的元素个数
get_group(("xx")) : 获取所在组对应的行

```

In [60]:
gb = df.groupby(['School', 'Gender'])
print(gb, gb.ngroups, gb.groups.keys(), gb.size(), sep = "\n\n")
gb.get_group(('Fudan University', 'Male')).iloc[ : 3 ] # 取前三列

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001BFA72165C0>

8

dict_keys([('Fudan University', 'Female'), ('Fudan University', 'Male'), ('Peking University', 'Female'), ('Peking University', 'Male'), ('Shanghai Jiao Tong University', 'Female'), ('Shanghai Jiao Tong University', 'Male'), ('Tsinghua University', 'Female'), ('Tsinghua University', 'Male')])

School                         Gender
Fudan University               Female    30
                               Male      10
Peking University              Female    22
                               Male      12
Shanghai Jiao Tong University  Female    41
                               Male      16
Tsinghua University            Female    48
                               Male      21
dtype: int64

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
41,Fudan University,Junior,Chunqiang Chu,Male,168.6,72.0,N,2,2019/10/16,0:03:58
48,Fudan University,Sophomore,Mei Xu,Male,177.3,79.0,N,1,2019/11/10,0:03:44

In [48]:
df[['School', 'Gender']].drop_duplicates()

                           School  Gender
0   Shanghai Jiao Tong University  Female
1               Peking University    Male
2   Shanghai Jiao Tong University    Male
3                Fudan University  Female
4                Fudan University    Male
5             Tsinghua University  Female
9               Peking University  Female
16            Tsinghua University    Male

# 聚合函数

In [62]:
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [69]:
gb = df.groupby("Gender")["Height"]

In [71]:
gb.idxmin()

Gender
Female    143
Male      199
Name: Height, dtype: int64

In [88]:
df[df.Gender == "Male"]["Height"].idxmin(), df[df.Gender == "Female"]["Height"].idxmin()

('Male : ', 199, 'Female : ', 143)

In [99]:
gb = df.groupby('Gender')[['Height', 'Weight']]
gb.min()

        Height  Weight
Gender
Female   145.4    34.0
Male     155.7    51.0

In [105]:
df[df.Gender == "Male"]["Height"].min(), df[df.Gender == "Female"]["Height"].min() ,df[df.Gender == "Male"]["Weight"].min(), df[df.Gender == "Female"]["Weight"].min()

(155.7, 145.4, 51.0, 34.0)

In [107]:
gb = df.groupby('Gender')[['Height', 'Weight']]
gb.agg(["sum", 'idxmax', 'mean'])

         Height                    Weight
            sum idxmax       mean     sum idxmax       mean
Gender
Female  21014.0     28  159.19697  6469.0     28  47.918519
Male     8854.9    193  173.62549  3929.0      2  72.759259

In [108]:
gb.agg({'Height':['mean','max'], 'Weight':['count']})

           Height        Weight
             mean    max  count
Gender
Female  159.19697  170.2    135
Male    173.62549  193.9     54

使用自定义函数

In [111]:
gb.agg(lambda x: x.mean() - x.min())

          Height     Weight
Gender
Female  13.79697  13.918519
Male    17.92549  21.759259

In [114]:
gb.describe()

       Height                                                              \
        count       mean       std    min      25%    50%      75%    max
Gender
Female  132.0  159.19697  5.053982  145.4  155.675  159.6  162.825  170.2
Male     51.0  173.62549  7.048485  155.7  168.900  173.4  177.150  193.9

       Weight
        count       mean       std   min   25%   50%    75%   max
Gender
Female  135.0  47.918519  5.405983  34.0  44.0  48.0  52.00  63.0
Male     54.0  72.759259  7.772557  51.0  69.0  73.0  78.75  89.0

In [117]:
gb.agg(["count", 'mean', 'std', 'quantile', 'min', 'max'])

       Height                                             Weight             \
        count       mean       std quantile    min    max  count       mean
Gender
Female    132  159.19697  5.053982    159.6  145.4  170.2    135  47.918519
Male       51  173.62549  7.048485    173.4  155.7  193.9     54  72.759259


             std quantile   min   max
Gender
Female  5.405983     48.0  34.0  63.0
Male    7.772557     73.0  51.0  89.0

判断组的指标均值，和该指标的总体均值

```
可以假设分组后的数据， 传入函数中去分别计算，并返回标量值
```

In [124]:
def my_func(s):
    res = 'High'
#   df[s.name]是当前的名字， 如Female的Height、Female的Weight、Male的Height、Male的Weight
    if s.mean() <= df[s.name].mean():
        res = 'Low'
#   返回值是标量
    return res

gb.agg(my_func)

       Height Weight
Gender
Female    Low    Low
Male     High   High

In [132]:
# 重命名, 传入元组
gb.agg([("my_sum", "sum"), ("my_func", lambda x : x.max() - x.min())])

         Height          Weight
         my_sum my_func  my_sum my_func
Gender
Female  21014.0    24.8  6469.0    29.0
Male     8854.9    38.2  3929.0    38.0

In [141]:
gb.agg({"Height" : [("my_sum" , "sum"), ("my_func" , lambda x : x.max() - x.min())]
       , "Weight" : ["max"]})

         Height         Weight
         my_sum my_func    max
Gender
Female  21014.0    24.8   63.0
Male     8854.9    38.2   89.0

# 变换和过滤

[transform函数](https://blog.csdn.net/weixin_38008864/article/details/102549813)

###  todo  没搞懂分俩个意思。。。

In [142]:
gb = df.groupby('Gender')[['Height', 'Weight']]

In [153]:
gb.transform(lambda x: (x-x.mean())/x.std()).head()

     Height    Weight
0 -0.058760 -0.354888
1 -1.010925 -0.355000
2  2.167063  2.089498
3       NaN -1.279789
4  0.053133  0.159631

In [159]:
x = df.Height
(x-x.mean()) / x.std()

0     -0.501579
1      0.381230
2      2.983195
3           NaN
4      1.252424
         ...
195   -1.082375
196   -0.269261
197   -1.082375
198    1.403431
199   -0.873288
Name: Height, Length: 200, dtype: float64

# 跨列分组

### 弄清apply和agg自定义函数传入值的含义

### 1）agg自定义函数
```
根据两个比较，可以发现自定义函数中， 传入值是分组后的数据
且 Male-Height、Male-Weight、Female-Height、Female-Weight分开组合
```

In [200]:
gb = df.groupby('Gender')[['Height', 'Weight']]
def my_func(s):
    res = 'High'
    print(s)
    return res
ans = gb.agg(my_func)

0      158.9
3        NaN
5      158.0
6      162.5
7      161.9
       ...
191    166.6
194    160.3
195    153.9
196    160.9
197    153.9
Name: Height, Length: 141, dtype: float64
1      166.5
2      188.9
4      174.0
10     174.1
16     170.1
17     162.8
18     170.3
21     166.0
23     183.9
24     167.4
35     175.4
36       NaN
38     185.3
40     175.0
41     168.6
48     177.3
50     171.4
54     162.4
60       NaN
61     172.8
66     177.1
71     183.4
72     166.8
73     176.3
74     169.4
76     174.6
82     175.6
91       NaN
94     169.9
95     178.7
98       NaN
99     181.3
102      NaN
116    167.2
117    180.2
127    173.4
131    177.2
134    186.5
135    167.6
147    169.2
150    170.7
152      NaN
153    172.2
158    176.1
160    173.4
162    168.4
165    170.1
171    176.4
177    167.1
178      NaN
179    175.5
181      NaN
182    170.5
184    178.9
190    177.3
192    166.8
193    193.9
198    175.3
199    155.7
Name: Height, dtype: float64
0      46.0
3      41.0
5      51.0
6      52.0
7      50.0
       ...
191    54.0
194    49.0
195    46.0
196    50.0
197    45.0
Name: Weight, Length: 141, dtype: float64
1      70.0
2      89.0
4      74.0
10     74.0
16     68.0
17     65.0
18     71.0
21     62.0
23     87.0
24     69.0
35     78.0
36     79.0
38     87.0
40     79.0
41     72.0
48     79.0
50     70.0
54     58.0
60     65.0
61      NaN
66     81.0
71     82.0
72     70.0
73     74.0
74     74.0
76      NaN
82     76.0
91      NaN
94     67.0
95     75.0
98     68.0
99     83.0
102     NaN
116    66.0
117    83.0
127    77.0
131    73.0
134    83.0
135    64.0
147    69.0
150    70.0
152    62.0
153    75.0
158    76.0
160    72.0
162    65.0
165    69.0
171    80.0
177    71.0
178    76.0
179    73.0
181    55.0
182    73.0
184    80.0
190     NaN
192    70.0
193    79.0
198    71.0
199    51.0
Name: Weight, dtype: float64

In [188]:
print(df[df.Gender == "Female"].Height.head(), df[df.Gender == "Male"].Height.head(), sep = "\n\n")

0    158.9
3      NaN
5    158.0
6    162.5
7    161.9
Name: Height, dtype: float64

1     166.5
2     188.9
4     174.0
10    174.1
16    170.1
Name: Height, dtype: float64

### 2）apply自定义函数
```
根据两个比较，可以发现自定义函数中， 传入值是分组后的数据
但和agg函数不同， 分成两组Male-Height-Weight、Female-Height-Weight两组
```

In [197]:
df[df.Gender == "Female"][['Height', 'Weight']].head()

   Height  Weight
0   158.9    46.0
3     NaN    41.0
5   158.0    51.0
6   162.5    52.0
7   161.9    50.0

In [198]:
def BMI(x):
    print(x)
    Height = x['Height']/100
    Weight = x['Weight']
    BMI_value = Weight/Height**2
    return BMI_value.mean()
ans = gb.apply(BMI)

     Height  Weight
0     158.9    46.0
3       NaN    41.0
5     158.0    51.0
6     162.5    52.0
7     161.9    50.0
..      ...     ...
191   166.6    54.0
194   160.3    49.0
195   153.9    46.0
196   160.9    50.0
197   153.9    45.0

[141 rows x 2 columns]
     Height  Weight
1     166.5    70.0
2     188.9    89.0
4     174.0    74.0
10    174.1    74.0
16    170.1    68.0
17    162.8    65.0
18    170.3    71.0
21    166.0    62.0
23    183.9    87.0
24    167.4    69.0
35    175.4    78.0
36      NaN    79.0
38    185.3    87.0
40    175.0    79.0
41    168.6    72.0
48    177.3    79.0
50    171.4    70.0
54    162.4    58.0
60      NaN    65.0
61    172.8     NaN
66    177.1    81.0
71    183.4    82.0
72    166.8    70.0
73    176.3    74.0
74    169.4    74.0
76    174.6     NaN
82    175.6    76.0
91      NaN     NaN
94    169.9    67.0
95    178.7    75.0
98      NaN    68.0
99    181.3    83.0
102     NaN     NaN
116   167.2    66.0
117   180.2    83.0
127   173.4    77.0
131   177.2    73.0
134   186.5    83.0
135   167.6    64.0
147   169.2    69.0
150   170.7    70.0
152     NaN    62.0
153   172.2    75.0
158   176.1    76.0
160   173.4    72.0
162   168.4    65.0
165   170.1    69.0
171   176.4    80.0
177   167.1    71.0
178     NaN    76.0
179   175.5    73.0
181     NaN    55.0
182   170.5    73.0
184   178.9    80.0
190   177.3     NaN
192   166.8    70.0
193   193.9    79.0
198   175.3    71.0
199   155.7    51.0

In [203]:
def BMI(x):
#   因为x是Height和Weight的两个组合， 所以需要进行索引取出两列不同的值
    Height = x['Height']/100
    Weight = x['Weight']
    BMI_value = Weight / Height**2
    return BMI_value.mean()
gb.apply(BMI)

Gender
Female    18.860930
Male      24.318654
dtype: float64

In [207]:
gb = df.groupby(['Gender','Test_Number'])[['Height','Weight']]

In [209]:
df["Test_Number"].unique()

array([1, 2, 3], dtype=int64)

In [216]:
gb.groups.keys()

dict_keys([('Female', 1), ('Female', 2), ('Female', 3), ('Male', 1), ('Male', 2), ('Male', 3)])